Autodesk.Navisworks.Api.PickResults
The result of a pick action.

Autodesk.Navisworks.Api.PickResults.None


Autodesk.Navisworks.Api.PickResults.Edge0To1


Autodesk.Navisworks.Api.PickResults.Edge1To2


Autodesk.Navisworks.Api.PickResults.Edge2To0


Autodesk.Navisworks.Api.PickResults.Edge


Autodesk.Navisworks.Api.PickResults.Vertex0


Autodesk.Navisworks.Api.PickResults.Vertex1


Autodesk.Navisworks.Api.PickResults.Vertex2


Autodesk.Navisworks.Api.PickResults.Vertex


Autodesk.Navisworks.Api.PickResults.LineVertex0


Autodesk.Navisworks.Api.PickResults.LineVertex1


Autodesk.Navisworks.Api.PickResults.LineVertex


Autodesk.Navisworks.Api.PickResults.LineMiddle


Autodesk.Navisworks.Api.PickResults.ArcCenter


Autodesk.Navisworks.Api.PickResults.Contained
